// pages/courseIndex/courseIndex.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    courseList:[]
  },

  //云端获取的数据
  clouddata:{
    courseList:[
      {
        cid:0,
        title:"强迫症",
        price:10,
        img:"https://bkimg.cdn.bcebos.com/pic/b2de9c82d158ccbf484c03131bd8bc3eb1354122?x-bce-process=image/resize,m_lfit,w_268,limit_1/format,f_jpg",
        des:"它是指以反复出现强迫观念和强迫动作为基础特征的一类神经强迫症性障碍。观念是以刻板形成反复进入患者意识领域的思想，表象或意向。这些思想、表象或意向对患者来说，这是没有现实意义的，不必要或多余的；患者意识到这些都是他自己的思想，很想摆脱，但又无能为力，因而非常苦恼。强迫动作是反复出现的刻板行为或仪式动作，是患者屈从于强迫观念，为求减轻内心焦虑的结果",
        introduce_words:"课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情"
      },
      {
        cid:1,
        title:"强迫症",
        price:10,
        img:"https://bkimg.cdn.bcebos.com/pic/b2de9c82d158ccbf484c03131bd8bc3eb1354122?x-bce-process=image/resize,m_lfit,w_268,limit_1/format,f_jpg",
        des:"它是指以反复出现强迫观念和强迫动作为基础特征的一类神经强迫症性障碍。观念是以刻板形成反复进入患者意识领域的思想，表象或意向。这些思想、表象或意向对患者来说，这是没有现实意义的，不必要或多余的；患者意识到这些都是他自己的思想，很想摆脱，但又无能为力，因而非常苦恼。强迫动作是反复出现的刻板行为或仪式动作，是患者屈从于强迫观念，为求减轻内心焦虑的结果",
        introduce_words:"课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情"
      },
      {
        cid:2,
        title:"强迫症",
        price:10,
        img:"https://bkimg.cdn.bcebos.com/pic/b2de9c82d158ccbf484c03131bd8bc3eb1354122?x-bce-process=image/resize,m_lfit,w_268,limit_1/format,f_jpg",
        des:"它是指以反复出现强迫观念和强迫动作为基础特征的一类神经强迫症性障碍。观念是以刻板形成反复进入患者意识领域的思想，表象或意向。这些思想、表象或意向对患者来说，这是没有现实意义的，不必要或多余的；患者意识到这些都是他自己的思想，很想摆脱，但又无能为力，因而非常苦恼。强迫动作是反复出现的刻板行为或仪式动作，是患者屈从于强迫观念，为求减轻内心焦虑的结果",
        introduce_words:"课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情"
      },
      {
        cid:3,
        title:"强迫症",
        price:10,
        img:"https://bkimg.cdn.bcebos.com/pic/b2de9c82d158ccbf484c03131bd8bc3eb1354122?x-bce-process=image/resize,m_lfit,w_268,limit_1/format,f_jpg",
        des:"它是指以反复出现强迫观念和强迫动作为基础特征的一类神经强迫症性障碍。观念是以刻板形成反复进入患者意识领域的思想，表象或意向。这些思想、表象或意向对患者来说，这是没有现实意义的，不必要或多余的；患者意识到这些都是他自己的思想，很想摆脱，但又无能为力，因而非常苦恼。强迫动作是反复出现的刻板行为或仪式动作，是患者屈从于强迫观念，为求减轻内心焦虑的结果",
        introduce_words:"课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情"
      },
      {
        cid:4,
        title:"强迫症",
        price:10,
        img:"https://bkimg.cdn.bcebos.com/pic/b2de9c82d158ccbf484c03131bd8bc3eb1354122?x-bce-process=image/resize,m_lfit,w_268,limit_1/format,f_jpg",
        des:"它是指以反复出现强迫观念和强迫动作为基础特征的一类神经强迫症性障碍。观念是以刻板形成反复进入患者意识领域的思想，表象或意向。这些思想、表象或意向对患者来说，这是没有现实意义的，不必要或多余的；患者意识到这些都是他自己的思想，很想摆脱，但又无能为力，因而非常苦恼。强迫动作是反复出现的刻板行为或仪式动作，是患者屈从于强迫观念，为求减轻内心焦虑的结果",
        introduce_words:"课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情"
      },
      {
        cid:5,
        title:"强迫症",
        price:10,
        img:"https://bkimg.cdn.bcebos.com/pic/b2de9c82d158ccbf484c03131bd8bc3eb1354122?x-bce-process=image/resize,m_lfit,w_268,limit_1/format,f_jpg",
        des:"它是指以反复出现强迫观念和强迫动作为基础特征的一类神经强迫症性障碍。观念是以刻板形成反复进入患者意识领域的思想，表象或意向。这些思想、表象或意向对患者来说，这是没有现实意义的，不必要或多余的；患者意识到这些都是他自己的思想，很想摆脱，但又无能为力，因而非常苦恼。强迫动作是反复出现的刻板行为或仪式动作，是患者屈从于强迫观念，为求减轻内心焦虑的结果",
        introduce_words:"课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情"
      },
      {
        cid:6,
        title:"强迫症",
        price:10,
        img:"https://bkimg.cdn.bcebos.com/pic/b2de9c82d158ccbf484c03131bd8bc3eb1354122?x-bce-process=image/resize,m_lfit,w_268,limit_1/format,f_jpg",
        des:"它是指以反复出现强迫观念和强迫动作为基础特征的一类神经强迫症性障碍。观念是以刻板形成反复进入患者意识领域的思想，表象或意向。这些思想、表象或意向对患者来说，这是没有现实意义的，不必要或多余的；患者意识到这些都是他自己的思想，很想摆脱，但又无能为力，因而非常苦恼。强迫动作是反复出现的刻板行为或仪式动作，是患者屈从于强迫观念，为求减轻内心焦虑的结果",
        introduce_words:"课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情"
      },
      {
        cid:7,
        title:"强迫症",
        price:10,
        img:"https://bkimg.cdn.bcebos.com/pic/b2de9c82d158ccbf484c03131bd8bc3eb1354122?x-bce-process=image/resize,m_lfit,w_268,limit_1/format,f_jpg",
        des:"它是指以反复出现强迫观念和强迫动作为基础特征的一类神经强迫症性障碍。观念是以刻板形成反复进入患者意识领域的思想，表象或意向。这些思想、表象或意向对患者来说，这是没有现实意义的，不必要或多余的；患者意识到这些都是他自己的思想，很想摆脱，但又无能为力，因而非常苦恼。强迫动作是反复出现的刻板行为或仪式动作，是患者屈从于强迫观念，为求减轻内心焦虑的结果",
        introduce_words:"课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情课程详情"
      }
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
    wx.showLoading({
      title: '加载中',
    })
    this.getCourse();
    wx.hideLoading();
  },

  /**
   * 从云端获取课程数据
   */
  getCourse() {
    let courseList = this.clouddata.courseList;
    this.setData({
      courseList
    })
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})